# AreaReinforcementRegenFail Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..AreaReinforcementRegenFail Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Can't regenerate Area Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaReinforcementRegenFail { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaReinforcementRegenFail As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaReinforcementRegenFail {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace